FROM oven/bun:1.2-alpine AS base

# ================================================================================================
# ЭТАП СБОРКИ
# ================================================================================================
FROM base AS builder

# Устанавливаем рабочую директорию
WORKDIR /usr/src/app

# Копируем файлы зависимостей
COPY bun.lockb ./
COPY package*.json ./

# Устанавливаем зависимости для сборки (не включая dev)
RUN bun install -p

# Копируем исходный код
COPY . .

# Собираем приложение
RUN bun run build

# ================================================================================================
# ЭТАП УСТАНОВКИ ПРОДАКШЕН-ЗАВИСИМОСТЕЙ (которые не были включены в сборку)
# ================================================================================================
FROM base AS pre-prod

# Устанавливаем рабочую директорию
WORKDIR /usr/src/app

# Устанавливаем продакшен-зависимости (которые не были включены в сборку)
# (в данном случае это @google-cloud/firestore и @googleapis/calendar)
RUN bun install @google-cloud/firestore @googleapis/calendar

# ================================================================================================
# ЭТАП ПРОДАКШЕНА
# ================================================================================================
FROM alpine:3.22 AS production

# Устанавливаем необходимые зависимости
RUN apk add --no-cache libstdc++ gcc

# Устанавливаем рабочую директорию
WORKDIR /usr/src/app

#  Копируем собранное приложение из этапа сборки
COPY --from=builder /usr/src/app/t-schedule ./

# Копируем файл зависимостей которые не были включены в сборку
COPY --from=pre-prod /usr/src/app/node_modules ./node_modules

# Устанавливаем переменные окружения
ENV PORT=80
EXPOSE 80

# Команда для запуска приложения
CMD [ "./t-schedule" ]
