FROM oven/bun:1.2-alpine AS base

# ================================================================================================
# ЭТАП СБОРКИ
# ================================================================================================
FROM base AS builder

# Устанавливаем рабочую директорию
WORKDIR /usr/src/app

# Копируем файлы зависимостей
COPY bun.lockb ./
COPY package*.json ./

# Устанавливаем зависимости для сборки (не включая dev)
RUN bun install -p

# Копируем исходный код
COPY . .

# Собираем приложение
RUN bun run build

# ================================================================================================
# ЭТАП ПРОДАКШЕНА
# ================================================================================================
FROM alpine:3.22 AS production

# Устанавливаем необходимые зависимости
RUN apk add --no-cache libstdc++ gcc

# Устанавливаем рабочую директорию
WORKDIR /usr/src/app

#  Копируем собранное приложение из этапа сборки
COPY --from=builder /usr/src/app/t-schedule ./

# Устанавливаем зависимости для продакшена (которые не были включены в сборку)
RUN BUN_BE_BUN=1 ./t-schedule install @google-cloud/firestore

# Устанавливаем переменные окружения
ENV PORT=80
EXPOSE 80

# Команда для запуска приложения
CMD [ "./t-schedule" ]
